# This file should contain all the record creation needed to seed the database with its default values.
# The data can then be loaded with the rails db:seed command (or created alongside the database with db:setup).
#
# Examples:
#
#   movies = Movie.create([{ name: 'Star Wars' }, { name: 'Lord of the Rings' }])
#   Character.create(name: 'Luke', movie: movies.first)

values = [
  ['ИФНС 1', '105064,г. Москва, Земляной вал ул., д.9', '+7 (495) 400-00-01'],
  ['ИФНС 2', '129110, г. Москва, ул. Б. Переяславская, д. 16', '+7 (495) 400-02-01'],
  ['ИФНС 3', '123100, г. Москва, ул. Анатолия Живова, д. 2, стр. 6', '+7(495)400-03-12'],
  ['ИФНС 4', '119048, г. Москва, ул. Доватора, д. 12, корп. 2, стр. 5', '+7 (495) 400-04-32'],
  ['ИФНС 5', '105064, г. Москва,ул.Земляной вал, д.9', '+7 (495) 400-05-61'],
  ['ИФНС 6', '115191, г. Москва, ул. Большая Тульская, д. 15', '+7 (495) 400-06-00'],
  ['ИФНС 7', '105064, г. Москва, ул. Земляной вал, д.9', '+7 (495) 400-00-07'],
  ['ИФНС 8', '129110, г. Москва, Б.Переяславская д.16', '+7 (495) 400-02-85'],
  ['ИФНС 9', '109316, г. Москва, Волгоградский проспект, д. 42, корп. 26', '+7 (495) 400-13-49'],
  ['ИФНС 10', '115191, г. Москва, ул. Большая Тульская, 15', '+7 (495) 400-06-30'],
  ['ИФНС 13', '105064 г. Москва, ул. Земляной вал, дом 9', '+7 (495) 400-37-99'],
  ['ИФНС 14', '125057, Москва, Чапаевский пер., д. 8,', '+7 (495) 400-16-46'],
  ['ИФНС 43', '115191, г. Москва, ул. Большая Тульская, д. 15', '+7 (495) 400-31-30'],
  ['ИФНС 15', '127254,г.Москва, ул.Руставели,дом 12/7', '+7 (495) 400-17-24'],
  ['ИФНС 16', '129346, г. Москва, ул. Малыгина, д. 3, корп. 2', '+7 (495) 400-17-51'],
  ['ИФНС 17', '129626, г.Москва, ул.3-я Мытищинская, д.16а', '+7 (495) 400-18-06'],
  ['ИФНС 18', '107113, г. Москва, ул. Шумкина, д. 25', '+7 (495) 400-18-33'],
  ['ИФНС 19', '105523, г. Москва, Щелковское ш., д. 90а', '+7 (495) 400-18-95'],
  ['ИФНС 20', '111141, г. Москва, Зеленый пр-т, д. 7а', '+7 (495) 400-19-52'],
  ['ИФНС 21', '109377, г. Москва, 1-я Новокузьминская, 5', '+7 (495) 400-19-68'],
  ['ИФНС 22', '111024, г. Москва, шоссе Энтузиастов, д. 14', '+7 (495) 400-20-29'],
  ['ИФНС 23', '109386, г. Москва, Таганрогская ул., д. 2', '+7 (495) 400-21-42'],
  ['ИФНС 24', '115409, г. Москва, Каширское шоссе, д. 44, корп. 4', '+7 (495) 400-22-55'],
  ['ИФНС 25', '115193, г. Москва, 5-я Кожуховская ул., д.1/11', '+7 (495) 400-35-10'],
  ['ИФНС 26', '117639, г. Москва, Черноморский бульвар, д.1, корп.1', '+7 (495) 400-23-38'],
  ['ИФНС 27', '117418, г. Москва, ул. Новочеремушкинская, д. 58, корп. 1', '+7 (495) 400-24-17'],
  ['ИФНС 28', '117149, г. Москва, ул. Сивашская, дом 5', '+7 (495) 400-25-35'],
  ['ИФНС 36', '119296, Москва, Ленинский пр-т, дом 70/11;', '+7 (495) 400-30-67'],
  ['ИФНС 29', '119454, г. Москва, ул. Лобачевского, д. 66а', '+7 (495) 400-63-67'],
  ['ИФНС 30', '121433, г. Москва, ул. М. Филевская, д. 10, стр. 3', '+7 (495) 400-45-76'],
  ['ИФНС 31', 'г. Москва, ул. Молодогвардейская, д.23, корп.1', '+7 (495) 400-27-70'],
  ['ИФНС 33', '125373, г. Москва, Походный проезд, домовладение 3', '+7 (495) 400-28-43'],
  ['ИФНС 34', '123308, г. Москва, Проспект Маршала Жукова, дом 1', '+7 (495) 400-29-39'],
  ['ИФНС 35', '124482 Москва, Зеленоград, ул. Юности, дом. 5', '+7 (495) 400-29-95'],
  ['ИФНС 45', '125373, г. Москва, Походный проезд, д.3', '+7 (495) 400-31-93'],
  ['ИФНС 46', '125373, г. Москва, Походный проезд, домовладение 3, стр.2', '+7 (495) 400-32-82'],
  ['ИФНС 47', '125373, Москва, Походный проезд, владение 3, корп.1, 5 этаж', '+7 (495) 400-33-39'],
  ['ИФНС 48', '125373, г. Москва, Походный проезд, домовладение 3, стр.2', '+7 (495) 400-34-23'],
  ['ИФНС 49', 'г.Москва, ул. 3-Рощинская, д.3, стр.2', '+7 (495) 400-35-91'],
  ['ИФНС 50', '125373, г. Москва, Походный проезд, вл.3, корп.А', '+7 (495) 400-00-50'],
  ['ИФНС 51', '119618, г. Москва, ул. 50 лет Октября, д.6', '+7 (495) 400-38-38'],
]

values.each do |value|
  Organization.create(name: value[0], address: value[1])
end